import React from 'react';

function About() {
  return (
    <section className="about">
      <div className="container">
        <h2>О свадьбе</h2>
        <div className="couple-story">
          <p>
            Мы счастливы пригласить вас на празднование нашей свадьбы!
          </p>
          <p>
            Мы понимаем, что это большое путешествие, и поэтому мы хотим сделать его максимально комфортным.
          </p>
          <p>
            У нас будет организован трансфер из центра Санкт-Петербурга на мероприятие и обратно на следующий день.
          </p>
          <p>
            Так же у нас будет организовано проживание в 2 домах, на территории площадки.
          </p>
        </div>
      </div>
    </section>
  );
}

export default About; 