import React from 'react';

function Gifts() {
  return (
    <section className="gifts">
      <div className="container">
        <h2>О подарках</h2>
        <div className="gifts-content">
          <div className="gifts-description">
            <p>
              Дорогие гости, для нас самый главный подарок - это ваше присутствие на нашем празднике!
            </p>
            <p>
              Если вы хотите сделать нам подарок, мы будем рады вашему вкладу в наше свадебное путешествие.
            </p>
            <p> 
             Пожалуйста, не обременяйте себя покупкой красивого букета, вы можете сделать выбор в пользу одного цветка или вовсе прийти без цветов 🧡🧡🧡
           </p>
          </div>
          
          <div className="gifts-note">
            <p>
                Просим вас расслабиться и погрузиться в атмосферу праздника. Все детали мероприятия уже продуманы. Ваша задача - наслаждаться!         
            </p>
          </div>
        </div>
      </div>
    </section>
  );
}

export default Gifts; 